In [3]:
import numpy as np

In [4]:
import pandas as pd

In [ ]:
# 숫자 데이터를 시리즈로 만들어 주세요.
# 값은 [5, 10, 15, 20] 이고, 인덱스는 자동으로 생성됩니다.
# 숫자 데이터를 시리즈로 만들어 주세요.
# 값은 [2, 4, 6, 8] 이고, 인덱스는 자동으로 생성됩니다.

In [7]:
s = pd.Series([5,10,15,20])
s

0     5
1    10
2    15
3    20
dtype: int64

In [9]:
s = pd.Series([2,4,6,8])
s

0    2
1    4
2    6
3    8
dtype: int64

In [ ]:
# 성적 데이터를 시리즈로 만들어주세요.
# 값은 점수 [70, 80, 90] 이고, 인덱스는 과목 ['국어', '영어', '수학'] 입니다.
# 1. 국어 점수를 조회하세요. (결과: 70점)
# 2. 수학 점수를 75점으로 수정하세요

In [14]:
s = pd.Series([70,80,90], index=['국어', '영어', '수학'])
s

국어    70
영어    80
수학    90
dtype: int64

In [17]:
s.loc['국어']

np.int64(70)

In [20]:
s['수학'] = 75
s

국어    70
영어    80
수학    75
dtype: int64

In [42]:
# 계절별 평균 기온 데이터를 시리즈로 만들어주세요.
# 값은 기온 [15, 27, 18] 이고, 인덱스는 계절 ['봄', '여름', '가을'] 입니다.
# 1. 봄 기온을 조회하세요. (결과: 15)
# 2. 가을 기온을 20으로 수정하세요.

s = pd.Series([15, 27, 18], index = ['봄', '여름', '가을'])
s

봄     15
여름    27
가을    18
dtype: int64

In [43]:
s.loc['봄']

np.int64(15)

In [29]:
s.loc['가을'] = 20
s

봄     15
여름    27
가을    20
dtype: int64

In [ ]:
# 일별 매출 데이터를 시리즈로 만들어주세요.
# 값은 매출 [1000, 1200, 1300] 이고, 인덱스는 날짜 ['01-01', '01-02', '01-03'] 입니다.
# 1. 1월 1일 매출을 조회하세요. (결과: 1000)
# 2. 1월 2일 매출을 1250으로 수정하세요

In [30]:
s = pd.Series([1000, 1200, 1300], index = ['01-01', '01-02', '01-03'])
s

01-01    1000
01-02    1200
01-03    1300
dtype: int64

In [31]:
s.loc['01-01']

np.int64(1000)

In [33]:
s.loc['01-02'] = 1250
s

01-01    1000
01-02    1250
01-03    1300
dtype: int64

In [ ]:
# 요일별 매출 데이터를 시리즈로 만들어주세요.
# 값은 매출 [300, 400, 500] 이고, 인덱스는 요일 ['월', '화', '수'] 입니다.
# 1. 화요일 매출을 조회하세요. (결과: 400)
# 2. 수요일 매출을 550으로 수정하세요

In [47]:
s = pd.Series([300, 400, 500], index = ['월', '화', '수'])
s

월    300
화    400
수    500
dtype: int64

In [48]:
s.loc['화']

np.int64(400)

In [38]:
s.loc['수'] = 550
s

월    300
화    400
수    550
dtype: object

In [ ]:
# 학생 성적 데이터를 데이터프레임으로 만들어주세요.
# 첫 번째 열은 학생 이름: ["철수", "영희", "민수"]
# 두 번째 열은 수학 점수: [85, 90, 78]
# 요일별 매출 데이터를 데이터프레임으로 만들어주세요.
# 첫 번째 열은 요일: ["월", "화", "수"]
# 두 번째 열은 매출: [1000, 1200, 900]

In [51]:
data = {'name':["철수", "영희", "민수"],
        'math':[85, 90, 78]
        }

In [57]:
df = pd.DataFrame(data)
df

  day  sales
0   월   1000
1   화   1200
2   수    900

In [54]:
data = {'day':["월", "화", "수"],
        'sales':[1000, 1200, 900]
        }

In [55]:
df = pd.DataFrame(data)
df

  day  sales
0   월   1000
1   화   1200
2   수    900

In [ ]:
# 과일 판매 데이터를 데이터프레임으로 만들어주세요.
# 값은 [[30, 50], [20, 40]]
# 행 이름(index)은 ['사과', '배']
# 열 이름(columns)은 ['판매량', '재고']
# 1. 사과의 판매량을 조회하세요. (결과: 30)
# 2. 새로운 열 '가격'을 추가하고, 사과는 1000원, 배는 1200원으로 입력하세요

In [63]:
data = np.array([[30, 50], [20, 40]])

df = pd.DataFrame(data, 
                  index=['사과', '배'], 
                  columns=['판매량', '재고']
                 )

df

    판매량  재고
사과   30  50
배    20  40

In [64]:
df.loc['사과', '판매량']

np.int64(30)

In [66]:
df['가격'] = [1000,1200]
df

    판매량  재고    가격
사과   30  50  1000
배    20  40  1200

In [ ]:
# 도시 데이터를 데이터프레임으로 만들어주세요.
# 값은 [[950, 1200], [500, 800]]
# 행 이름(index)은 ['서울', '부산']
# 열 이름(columns)은 ['인구', '면적']
# 1. 서울의 면적을 조회하세요. (결과: 1200)
# 2. 새로운 열 '특산물'을 추가하고, 서울은 "김치", 부산은 "어묵"으로 입력하세요.

In [67]:
data = np.array([[950, 1200], [500, 800]])

df = pd.DataFrame(data, 
                  index=['서울', '부산'], 
                  columns=['인구', '면적']
                 )

df

     인구    면적
서울  950  1200
부산  500   800

In [68]:
df.loc['서울', '면적']

np.int64(1200)

In [70]:
df['특산물'] = ['김치','어묵']
df

     인구    면적 특산물
서울  950  1200  김치
부산  500   800  어묵

In [ ]:
# 도서 데이터를 데이터프레임으로 만들어주세요.
# 값은 [[15000, '홍길동전'], [20000, '해리포터']]
# 행 이름(index)은 ['책1', '책2']
# 열 이름(columns)은 ['가격', '제목']
# 1. 책2의 가격을 조회하세요. (결과: 20000)
# 2. 새로운 열 '저자'를 가격 뒤에 추가하고, 책1은 "허균", 책2는 "J.K. 롤링"으로 입력하세요

In [71]:
data = np.array([[15000, '홍길동전'], [20000, '해리포터']])

df = pd.DataFrame(data,
                  index=['책1', '책2'],
                  columns=['가격', '제목']
                 )
df

       가격    제목
책1  15000  홍길동전
책2  20000  해리포터

In [84]:
df.loc['책2','가격']

'20000'

In [86]:
df.insert(1, '저자', ['허균', 'J.K. 롤링'])
df

       가격       저자    제목
책1  15000       허균  홍길동전
책2  20000  J.K. 롤링  해리포터